# usage:	[another program output | ] ruby t-logins.rb [ [<] file]		

trans = {
	"а"=>"a", "б"=>"b", "в"=>"v", "г"=>"g", "д"=>"d", "е"=>"e", "ё"=>"yo",
	"ж"=>"zh", "з"=>"z", "и"=>"i", "й"=>"j", "к"=>"k", "л"=>"l", "м"=>"m",
	"н"=>"n", "о"=>"o", "п"=>"p", "р"=>"r", "с"=>"s", "т"=>"t", "у"=>"u",
	"ф"=>"f", "х"=>"h", "ц"=>"c", "ч"=>"ch", "ш"=>"sh", "щ"=>"shh", "ъ"=>"#",
	"ы"=>"y", "ь"=>"'", "э"=>"je", "ю"=>"yu", "я"=>"ya"
}

downcase = {
	"А"=>"а", "Б"=>"б", "В"=>"в", "Г"=>"г", "Д"=>"д", "Е"=>"е", "Ё"=>"ё",
	"Ж"=>"ж", "З"=>"з", "И"=>"и", "Й"=>"й", "К"=>"к", "Л"=>"л", "М"=>"м",
	"Н"=>"н", "О"=>"о", "П"=>"п", "Р"=>"р", "С"=>"с", "Т"=>"т", "У"=>"у",
	"Ф"=>"ф", "Х"=>"х", "Ц"=>"ц", "Ч"=>"ч", "Ш"=>"ш", "Щ"=>"щ", "Ъ"=>"ъ",
	"Ы"=>"ы", "Ь"=>"ь", "Э"=>"э", "Ю"=>"ю", "Я"=>"я"
}

logins = []

ARGF.each do |i|
	name = i.to_s.chomp.gsub(/[А-Я]/, downcase).gsub(/[а-я]/, trans).split
	login = name[0][0] + name[1][0..6]
	if logins.include?(login)
		login = name[0][0..1] + name[1][0..5]
		n = 1
		while logins.include?(login)
			login = name[0][0] + name[1][0..(6-n.to_s.length)] + n.to_s
			n += 1
		end	
	end
	logins.push(login)
end
puts(logins)